#include <stdio.h>
#include <math.h>

int main() {
  float x, f;
  // Введення
  printf("\nВведіть число х: ");
  scanf("%f", &x);

  // Обчислення
  if (x > 0) {
    f = pow(x,2) + 4*x + 5;
    // Виведення
    printf("Відповідь: %.2f\n", f);
  }
  else {
    // Перевірка чи наявне ділення на 0
    if (pow(x,2) + 4*x + 5 == 0) {
      printf("Ви ввели некоректне значення х (виконується ділення на 0)\n");
    }
    else {
      f = 1 / (pow(x,2) + 4*x + 5);
      // Виведення
      printf("Відповідь: %.2f\n", f);
    }
  }
}